InformationRegisters/АС_ИндексOEMНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АС_ИндексOEMНоменклатуры</Name>
			<Comment>Служебный индекс нормализованных OEM для быстрого поиска аналогов.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>КлючOEM</Name>
					<Comment>OEM в нижнем регистре, содержащий только латинские буквы и цифры.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Запас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Операция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидРабот</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/АС_ИндексOEMСервер/Ext/Module.bsl
// Обновляет строки индекса для одной номенклатуры.
Процедура ОбновитьИндексНоменклатуры(Номенклатура, OEM, OEMПоМаркам, Индексировать) Экспорт

	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат;
	КонецЕсли;

	НаборЗаписей = РегистрыСведений.АС_ИндексOEMНоменклатуры.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);

	Если Индексировать Тогда
		НайденныеКлючи = Новый Соответствие;
		ДобавитьКлючиOEMВНабор(НаборЗаписей, Номенклатура, OEM, НайденныеКлючи);
		Для Каждого СтрокаOEM Из OEMПоМаркам Цикл
			ДобавитьКлючиOEMВНабор(НаборЗаписей, Номенклатура, СтрокаOEM.OEM, НайденныеКлючи);
		КонецЦикла;
	КонецЕсли;

	НаборЗаписей.Записать();

КонецПроцедуры

Процедура ДобавитьКлючиOEMВНабор(НаборЗаписей, Номенклатура, OEM, НайденныеКлючи)

	Для Каждого КлючOEM Из КлючиOEM(OEM) Цикл
		Если НайденныеКлючи.Получить(КлючOEM) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		НайденныеКлючи.Вставить(КлючOEM, Истина);
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Номенклатура = Номенклатура;
		НоваяЗапись.КлючOEM = КлючOEM;
	КонецЦикла;

КонецПроцедуры

// Создает полный индекс при первом обращении после установки расширения.
Процедура ОбеспечитьИндекс() Экспорт

	Если Константы.АС_ИндексOEMИнициализирован.Получить() Тогда
		Возврат;
	КонецЕсли;

	ТранзакцияНачата = Ложь;
	Попытка
		Если Не ТранзакцияАктивна() Тогда
			НачатьТранзакцию();
			ТранзакцияНачата = Истина;
		КонецЕсли;

		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить(
			"РегистрСведений.АС_ИндексOEMНоменклатуры");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();

		Если Не Константы.АС_ИндексOEMИнициализирован.Получить() Тогда
			ПерестроитьИндекс();
			Константы.АС_ИндексOEMИнициализирован.Установить(Истина);
		КонецЕсли;

		Если ТранзакцияНачата Тогда
			ЗафиксироватьТранзакцию();
			ТранзакцияНачата = Ложь;
		КонецЕсли;
	Исключение
		Если ТранзакцияНачата И ТранзакцияАктивна() Тогда
			ОтменитьТранзакцию();
		КонецЕсли;
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

Процедура ПерестроитьИндекс()

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|Номенклатура.Ссылка КАК Номенклатура,
		|Номенклатура.АС_OEM КАК OEM
		|ИЗ
		|Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|НЕ Номенклатура.ЭтоГруппа
		|И НЕ Номенклатура.ПометкаУдаления
		|И НЕ Номенклатура.Недействителен
		|И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)");

	НаборЗаписей = РегистрыСведений.АС_ИндексOEMНоменклатуры.СоздатьНаборЗаписей();
	НайденныеКлючиПоНоменклатуре = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		КлючНоменклатуры = Строка(Выборка.Номенклатура);
		НайденныеКлючи = НайденныеКлючиПоНоменклатуре.Получить(КлючНоменклатуры);
		Если НайденныеКлючи = Неопределено Тогда
			НайденныеКлючи = Новый Соответствие;
			НайденныеКлючиПоНоменклатуре.Вставить(КлючНоменклатуры, НайденныеКлючи);
		КонецЕсли;
		ДобавитьКлючиOEMВНабор(НаборЗаписей, Выборка.Номенклатура, Выборка.OEM, НайденныеКлючи);
	КонецЦикла;

	ЗапросПоМаркам = Новый Запрос(
		"ВЫБРАТЬ
		|OEMПоМаркам.Ссылка КАК Номенклатура,
		|OEMПоМаркам.OEM КАК OEM
		|ИЗ
		|Справочник.Номенклатура.АС_OEMПоМаркам КАК OEMПоМаркам
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		|ПО OEMПоМаркам.Ссылка = Номенклатура.Ссылка
		|ГДЕ
		|НЕ Номенклатура.ЭтоГруппа
		|И НЕ Номенклатура.ПометкаУдаления
		|И НЕ Номенклатура.Недействителен
		|И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)");
	Выборка = ЗапросПоМаркам.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		КлючНоменклатуры = Строка(Выборка.Номенклатура);
		НайденныеКлючи = НайденныеКлючиПоНоменклатуре.Получить(КлючНоменклатуры);
		Если НайденныеКлючи = Неопределено Тогда
			НайденныеКлючи = Новый Соответствие;
			НайденныеКлючиПоНоменклатуре.Вставить(КлючНоменклатуры, НайденныеКлючи);
		КонецЕсли;
		ДобавитьКлючиOEMВНабор(НаборЗаписей, Выборка.Номенклатура, Выборка.OEM, НайденныеКлючи);
	КонецЦикла;
	НаборЗаписей.Записать();

КонецПроцедуры

Функция КлючиOEM(OEM)

	Результат = Новый Массив;
	НайденныеКлючи = Новый Соответствие;
	СтрокаOEM = СтрЗаменить(Строка(OEM), ",", ";");
	СтрокаOEM = СтрЗаменить(СтрокаOEM, Символы.ВК, ";");
	СтрокаOEM = СтрЗаменить(СтрокаOEM, Символы.ПС, ";");

	Для Каждого ЧастьOEM Из СтрРазделить(СтрокаOEM, ";", Ложь) Цикл
		КлючOEM = НормализоватьOEM(ЧастьOEM);
		Если Не ПустаяСтрока(КлючOEM)
			И НайденныеКлючи.Получить(КлючOEM) = Неопределено Тогда
			НайденныеКлючи.Вставить(КлючOEM, Истина);
			Результат.Добавить(КлючOEM);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция НормализоватьOEM(OEM) Экспорт

	ИсходноеЗначение = НРег(СокрЛП(Строка(OEM)));
	ИсходноеЗначение = СтрЗаменить(ИсходноеЗначение, Символы.НПП, " ");

	// Частая ошибка ввода: визуально похожие кириллические буквы среди латиницы.
	ИсходноеЗначение = СтрЗаменить(ИсходноеЗначение, "а", "a");
	ИсходноеЗначение = СтрЗаменить(ИсходноеЗначение, "в", "b");
	ИсходноеЗначение = СтрЗаменить(ИсходноеЗначение, "с", "c");
	ИсходноеЗначение = СтрЗаменить(ИсходноеЗначение, "е", "e");
	ИсходноеЗначение = СтрЗаменить(ИсходноеЗначение, "н", "h");
	ИсходноеЗначение = СтрЗаменить(ИсходноеЗначение, "к", "k");
	ИсходноеЗначение = СтрЗаменить(ИсходноеЗначение, "м", "m");
	ИсходноеЗначение = СтрЗаменить(ИсходноеЗначение, "о", "o");
	ИсходноеЗначение = СтрЗаменить(ИсходноеЗначение, "р", "p");
	ИсходноеЗначение = СтрЗаменить(ИсходноеЗначение, "т", "t");
	ИсходноеЗначение = СтрЗаменить(ИсходноеЗначение, "х", "x");
	ИсходноеЗначение = СтрЗаменить(ИсходноеЗначение, "у", "y");

	ДопустимыеСимволы = "abcdefghijklmnopqrstuvwxyz0123456789";
	Разделители = " -–—_./\()[]:+#" + Символы.Таб + Символы.ВК + Символы.ПС;
	Результат = "";
	Для Позиция = 1 По СтрДлина(ИсходноеЗначение) Цикл
		Символ = Сред(ИсходноеЗначение, Позиция, 1);
		Если СтрНайти(ДопустимыеСимволы, Символ) > 0 Тогда
			Результат = Результат + Символ;
		ИначеЕсли СтрНайти(Разделители, Символ) = 0 Тогда
			Возврат "";
		КонецЕсли;
	КонецЦикла;

	Если СтрДлина(Результат) > 150 Тогда
		Возврат "";
	КонецЕсли;
	Возврат Результат;

КонецФункции
